PavelSunStar/EVE2_esp32/src/eve/reg_dl.h
#pragma once

/*
 * Display List инструкции BT817/BT818 (EVE4).
 *
 * Это базовые 32-битные коды DL-инструкций. Параметры добавляются к ним
 * побитовыми операциями в функциях DISPLAY(), CLEAR(), VERTEX2F() и т. п.
 * Инструкции можно записывать прямо в RAM_DL или посылать через RAM_CMD
 * между CMD_DLSTART и CMD_SWAP.
 *
 * Это не команды сопроцессора CMD_* и не трёхбайтовые Host Commands.
 */

// =============================================================================
// Начало/окончание и переходы внутри Display List
// =============================================================================

#define DL_DISPLAY                (0x00UL << 24)  // Завершить Display List. Всегда ставится последней DL-инструкцией.
#define DL_CALL                   (0x1DUL << 24)  // Вызвать подпрограмму DL по адресу в RAM_DL.
#define DL_JUMP                   (0x1EUL << 24)  // Безусловно перейти к другому адресу в RAM_DL.
#define DL_BEGIN                  (0x1FUL << 24)  // Начать рисование выбранного графического примитива.
#define DL_END                    (0x21UL << 24)  // Завершить рисование примитива, начатого DL_BEGIN.
#define DL_RETURN                 (0x24UL << 24)  // Вернуться из DL-подпрограммы, вызванной DL_CALL.
#define DL_MACRO                  (0x25UL << 24)  // Выполнить команду из регистра REG_MACRO_0 или REG_MACRO_1.
#define DL_NOP                    (0x2DUL << 24)  // Ничего не выполнять; безопасный заполнитель Display List.

// =============================================================================
// Источник bitmap, формат, размеры и выбор изображения
// =============================================================================

#define DL_BITMAP_SOURCE          (0x01UL << 24)  // Задать адрес пиксельных данных bitmap в RAM_G или Flash.
#define DL_BITMAP_HANDLE          (0x05UL << 24)  // Выбрать bitmap handle 0–31 для следующих bitmap-операций.
#define DL_CELL                   (0x06UL << 24)  // Выбрать ячейку/кадр bitmap, содержащего несколько изображений.
#define DL_BITMAP_LAYOUT          (0x07UL << 24)  // Задать формат, шаг строки и высоту исходного bitmap.
#define DL_BITMAP_SIZE            (0x08UL << 24)  // Задать фильтрацию, wrap и отображаемый размер bitmap.
#define DL_BITMAP_LAYOUT_H        (0x28UL << 24)  // Старшие биты шага строки и высоты для DL_BITMAP_LAYOUT.
#define DL_BITMAP_SIZE_H          (0x29UL << 24)  // Старшие биты ширины и высоты для DL_BITMAP_SIZE.
#define DL_PALETTE_SOURCE         (0x2AUL << 24)  // Задать адрес палитры для PALETTED-форматов.
#define DL_BITMAP_EXT_FORMAT      (0x2EUL << 24)  // Задать расширенный формат bitmap, например ASTC.
#define DL_BITMAP_SWIZZLE         (0x2FUL << 24)  // Переназначить каналы R, G, B и A bitmap.

// =============================================================================
// Координаты вершин и геометрия примитивов
// =============================================================================

#define DL_POINT_SIZE             (0x0DUL << 24)  // Установить диаметр точек в единицах 1/16 пикселя.
#define DL_LINE_WIDTH             (0x0EUL << 24)  // Установить ширину линий в единицах 1/16 пикселя.
#define DL_VERTEX_FORMAT          (0x27UL << 24)  // Задать число дробных бит координат DL_VERTEX2F.
#define DL_VERTEX_TRANSLATE_X     (0x2BUL << 24)  // Добавить глобальное смещение X к последующим вершинам.
#define DL_VERTEX_TRANSLATE_Y     (0x2CUL << 24)  // Добавить глобальное смещение Y к последующим вершинам.

// VERTEX2F и VERTEX2II используют два старших бита, а не обычный 8-битный opcode.
#define DL_VERTEX2F               (0x01UL << 30)  // Вершина с координатами в формате, заданном DL_VERTEX_FORMAT.
#define DL_VERTEX2II              (0x02UL << 30)  // Целая вершина плюс bitmap handle и cell в одной инструкции.

// =============================================================================
// Цвет, прозрачность и очистка буферов
// =============================================================================

#define DL_CLEAR_COLOR_RGB        (0x02UL << 24)  // Установить RGB-цвет очистки цветового буфера.
#define DL_COLOR_RGB              (0x04UL << 24)  // Установить текущий RGB-цвет рисования.
#define DL_CLEAR_COLOR_A          (0x0FUL << 24)  // Установить alpha, используемую при очистке цветового буфера.
#define DL_COLOR_A                (0x10UL << 24)  // Установить текущую прозрачность рисования 0–255.
#define DL_CLEAR_STENCIL          (0x11UL << 24)  // Установить значение очистки stencil-буфера.
#define DL_CLEAR_TAG              (0x12UL << 24)  // Установить значение очистки tag-буфера.
#define DL_COLOR_MASK             (0x20UL << 24)  // Разрешить/запретить запись каналов R, G, B и A.
#define DL_CLEAR                  (0x26UL << 24)  // Очистить выбранные буферы: color, stencil и/или tag.

// Алиасы: команды принимают как отдельные RGB, так и готовый цвет 0xRRGGBB.
#define DL_CLEAR_COLOR            DL_CLEAR_COLOR_RGB  // Базовый opcode CLEAR_COLOR(c).
#define DL_COLOR                  DL_COLOR_RGB        // Базовый opcode COLOR(c).

// =============================================================================
// Alpha test, смешивание и stencil test
// =============================================================================

#define DL_ALPHA_FUNC             (0x09UL << 24)  // Настроить условие сравнения alpha с опорным значением.
#define DL_STENCIL_FUNC           (0x0AUL << 24)  // Настроить сравнение stencil: функция, reference и mask.
#define DL_BLEND_FUNC             (0x0BUL << 24)  // Выбрать коэффициенты смешивания source и destination.
#define DL_STENCIL_OP             (0x0CUL << 24)  // Задать действия stencil при провале и успехе теста.
#define DL_STENCIL_MASK           (0x13UL << 24)  // Ограничить биты, доступные для записи в stencil-буфер.

// =============================================================================
// Touch tags
// =============================================================================

#define DL_TAG                    (0x03UL << 24)  // Назначить touch tag 0–255 последующим нарисованным пикселям.
#define DL_TAG_MASK               (0x14UL << 24)  // Включить или отключить запись значений в tag-буфер.

// =============================================================================
// Матрица преобразования bitmap
// =============================================================================

#define DL_BITMAP_TRANSFORM_A     (0x15UL << 24)  // Коэффициент A: горизонтальный масштаб/поворот.
#define DL_BITMAP_TRANSFORM_B     (0x16UL << 24)  // Коэффициент B: горизонтальный масштаб/поворот.
#define DL_BITMAP_TRANSFORM_C     (0x17UL << 24)  // Коэффициент C: горизонтальное смещение bitmap.
#define DL_BITMAP_TRANSFORM_D     (0x18UL << 24)  // Коэффициент D: вертикальный масштаб/поворот.
#define DL_BITMAP_TRANSFORM_E     (0x19UL << 24)  // Коэффициент E: вертикальный масштаб/поворот.
#define DL_BITMAP_TRANSFORM_F     (0x1AUL << 24)  // Коэффициент F: вертикальное смещение bitmap.

// EXT-варианты используют те же opcode A/B/D/E, но также содержат бит точности P.
#define DL_BITMAP_TRANSFORM_A_EXT DL_BITMAP_TRANSFORM_A
#define DL_BITMAP_TRANSFORM_B_EXT DL_BITMAP_TRANSFORM_B
#define DL_BITMAP_TRANSFORM_D_EXT DL_BITMAP_TRANSFORM_D
#define DL_BITMAP_TRANSFORM_E_EXT DL_BITMAP_TRANSFORM_E

// =============================================================================
// Ограничение области рисования
// =============================================================================

#define DL_SCISSOR_XY             (0x1BUL << 24)  // Установить левый верхний угол clipping-области.
#define DL_SCISSOR_SIZE           (0x1CUL << 24)  // Установить ширину и высоту clipping-области.

// =============================================================================
// Сохранение и восстановление графического состояния
// =============================================================================

#define DL_SAVE_CONTEXT           (0x22UL << 24)  // Сохранить текущее графическое состояние в стек.
#define DL_RESTORE_CONTEXT        (0x23UL << 24)  // Восстановить последнее состояние из стека.

